OpenNuvoton/M251BSP/SampleCode/PowerManagement/TK_PowerDownMode/TK_UartCmd.c
/**************************************************************************//**
 * @file     TK_UartCmd.c
 * @version  V1.00
 * @brief    UART command to communicate with PC tool that for evaluate the Touch Key.
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2022 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "NuMicro.h"
#include "tklib.h"
#include "TK_Demo.h"

extern volatile int8_t i8SliderPercentage;
extern volatile int8_t i8WheelPercentage;
extern S_TKDEBOUNCE asPressedTouchKeys[];


/* CMD Type 1 */
#define E_CMD_TYPE1_SPECIFY_CHANNEL_MSK       (0x0)
#define E_CMD_TYPE1_SPECIFY_SLIDER_MSK        (0x1)
#define E_CMD_TYPE1_SPECIFY_WHEEL_MSK         (0x2)
#define E_CMD_TYPE1_SPECIFY_REF_SHIELD_NO     (0x3)
#define E_CMD_TYPE1_SPECIFY_FEATURE           (0x4)
#define E_CMD_TYPE1_SPECIFY_SENSE             (0x5)
#define E_CMD_TYPE1_SPECIFY_RESET_VOL         (0x6)
#define E_CMD_TYPE1_SPECIFY_STORE_ADDR        (0x7)
#define E_CMD_TYPE1_SPECIFY_NEIGHBORING       (0x8)
#define E_CMD_TYPE1_SPECIFY_CHANNEL_PIN       (0x9)
#define E_CMD_TYPE1_NUM_LAST_COMMAND          E_CMD_TYPE1_SPECIFY_CHANNEL_PIN

#define E_CMD_TYPE1_START_CALIBRATION         ('A')
#define E_CMD_TYPE1_RESET_CALIBRATION1        ('B')
#define E_CMD_TYPE1_RESET_CALIBRATION2        ('C')
#define E_CMD_TYPE1_WRITE_CALIBRATION         ('D')
#define E_CMD_TYPE1_LOAD_CALIBRATION          ('E')
#define E_CMD_TYPE1_START_RUN_TIME_SCAN_KEY   ('F')
#define E_CMD_TYPE1_ESCAPE_RUN_TIME_SCAN_KEY  ('G')
#define E_CMD_TYPE1_ESCAPE_APPLICATION        ('H')
#define E_CMD_TYPE1_IIR_PARAMETER             ('I')
#define E_CMD_TYPE1_DEBOUNCE_PARAMETER        ('J')
#define E_CMD_TYPE1_LAST_COMMAND              E_CMD_TYPE1_DEBOUNCE_PARAMETER

/* CMD Type 2 */
#define E_CMD_TYPE2_READ_CHANNEL_MSK          (0x10)
#define E_CMD_TYPE2_READ_SLIDER_MSK           (0x11)
#define E_CMD_TYPE2_READ_WHEEL_MSK            (0x12)
#define E_CMD_TYPE2_READ_REF_SHIELD_NO        (0x13)
#define E_CMD_TYPE2_READ_FEATURE              (0x14)
#define E_CMD_TYPE2_READ_SENSE                (0x15)
#define E_CMD_TYPE2_READ_RESET_VOL            (0x16)
#define E_CMD_TYPE2_READ_STORE_ADDR           (0x17)
#define E_CMD_TYPE2_READ_NEIGHBORING          (0x18)
#define E_CMD_TYPE2_READ_CHANNEL_PIN          (0x19)

#define E_CMD_TYPE2_CHECK_CALIBRATION_DONE    ('a')
#define E_CMD_TYPE2_GET_CALIBRATION1          ('b')
#define E_CMD_TYPE2_GET_CALIBRATION2          ('c')
#define E_CMD_TYPE2_RUNTIME_KEY_INFO          ('d')
#define E_CMD_TYPE2_GET_IIR_PARAMETER         ('i')
#define E_CMD_TYPE2_GET_DEBOUNCE_PARAMETER    ('j')
#define E_CMD_TYPE2_SET_SCAN_KEY              ('k')
#define E_CMD_TYPE2_EXPORT_CALIBRATION        ('n')
#define E_CMD_TYPE2_GET_RUNTIME_TK_PRESSED    ('q')

#ifdef MASS_FINETUNE
    #define E_CMD_TYPE2_GET_UID               ('l')
    void TK_MP_Open(void);                              /* Used for internal mass production */
    volatile uint8_t g_bIsFineTuneDone = 0;
    volatile uint8_t g_FineTuneDoneTimeOut = 0;
#endif

#define E_CMD_TYPE2_FIRMWARE_VERSION          ('v')
#define E_CMD_TYPE2_LAST_COMMAND              E_CMD_TYPE2_FIRMWARE_VERSION

/**
 * @brief       Send chars by UART interface
 * @param[i]    pu8buf  buffer pointer that contain the characters to be sent.
 * @param[i]    u32len  length of characters to be sent.
 * @return      None
 * @details     This Function used to send chars by UART interface
 */

volatile unsigned char td_flag = 1;
void TK_SendChars(uint8_t *pu8buf, uint32_t u32len)
{
    int i = 0;

    for (i = 0; i < u32len; i++)
    {
        UART_WRITE(TK_UART_PORT, pu8buf[i]);   /* output character */
    }

    while (TK_UART_PORT->FIFOSTS & UART_FIFOSTS_TXFULL_Msk);

}

/**
  * @brief      Get packet from AP tool and check if the header, data length and checksum are all correct
  * @param      None.
  * @retval     0:success.
  *             -1:fail
  * @details    This function is used to get command packet from AP tool
  *             AP transmission format:
  *             | HEADER BYTES('N''T''K') | CMD(1 byte) | LEN(2 bytes) | PAYLOAD(n bytes) | checkSum(1 byte) |
  *             Firmware would return status immediately
  *
  */

/* RX: PC--> DUT,
   TX: DUT--> PC */
/* Cmd = 0x0 ~ 0x8, 'A' ~ 'J'  */
#define E_RX_CMD_TYPE1_SIZE (6)         /* PC-->DUT */
/* DUT reply 'A' or 'N' only  */
#define E_TX_CMD_TYPE1_SIZE (1)         /* DUT-->PC */

/* Cmd = 0x10 ~ 0x16, 'a' ~ 'v' */
#define E_RX_CMD_TYPE2_SIZE (3)         /* PC-->DUT */
/* DUT reply parameter + 'A' or 'N' only  */
#define E_TX_CMD_TYPE2_SIZE (5)         /* DUT-->PC */


#define TXBUFSIZE   E_TX_CMD_TYPE2_SIZE
#define RXBUFSIZE   E_RX_CMD_TYPE1_SIZE
#define E_UART_TIME_OUT     (0x200000)
uint8_t g_u8TXBuf[TXBUFSIZE];
uint8_t g_u8RXBuf[RXBUFSIZE];


typedef enum
{
    E_CMD_WAIT = 0,
    E_CMD_TYPE1_READY,
    E_CMD_TYPE2_READY,
    E_CMD_TYPE1_WRONG = 0xFE,
    E_CMD_TYPE2_WRONG = 0xFF,
} E_CMDSTS;

#define E_CALIBRATION_DONE          (0)                         /* Calibration done only */
#define E_UNDER_CALIBRATION         (1)                         /* Under calibration done */
#define E_CALIBRATION_DONE_FREERUN  (0xFF)                      /* Calibration done and save to flash */
volatile uint8_t gu8Calibration = E_CALIBRATION_DONE_FREERUN;

volatile uint8_t gu8CmdSts = E_CMD_WAIT;
volatile uint8_t gu8comRtail = 0;
volatile uint8_t gu8ChkSum = 0;
volatile uint8_t gu8RunTimeKeyInfo = 0;
extern volatile uint8_t u8EventKeyScan;

void UART_StateInit(void)
{
    gu8CmdSts = E_CMD_WAIT;
    gu8ChkSum = 0;
    gu8comRtail = 0;
}

/**
  * @brief  There are total 6 bytes transfer from PC.
  *         PC : Cmd + 4 parameters + Checksum
  *         DUT: ACK/NACK only
  *
  * @param[in]  Touch key information pointer
  * @param[in]  RX buffer to receive data from PC
  * @param[in]  Length
  *
  * @return     0: Continue receive.
  *             1: Escape to do calibration
  * @details    Receive command from PC
  */
int8_t TK_CmdType1(uint8_t *pu8RXBuf)
{
    int8_t i8Ret = 0;
    uint8_t u8Chan;
    uint32_t u32Data;
    S_TKFEAT *psTkFeat;
    S_KEYINFO *pKeyInfo;
    S_TKINFO *psTkInfo;

#ifdef OPT_NEIGHBOR
    S_NEIGHBOR *psKeyNeighbor;
    psKeyNeighbor = TK_GetNeighborInfoPtr();
#endif

    psTkFeat = TK_GetFeaturePtr();
    pKeyInfo = TK_GetKeyInfoPtr();
    psTkInfo = TK_GetTKInfoPtr();

    *((uint8_t *)&u32Data) = pu8RXBuf[4];
    *((uint8_t *)&u32Data + 1) = pu8RXBuf[3];
    *((uint8_t *)&u32Data + 2) = pu8RXBuf[2];
    *((uint8_t *)&u32Data + 3) = pu8RXBuf[1];

    switch (*pu8RXBuf)
    {
        case E_CMD_TYPE1_SPECIFY_CHANNEL_MSK:
            psTkInfo->u32EnChanMsk = pu8RXBuf[1] | ((uint32_t)(pu8RXBuf[2]) << 8) | ((uint32_t)(pu8RXBuf[3]) << 16) | ((uint32_t)(pu8RXBuf[4]) << 24);
            break;


        case E_CMD_TYPE1_SPECIFY_SLIDER_MSK:
            psTkInfo->u32EnSliderMsk = pu8RXBuf[1] | ((uint32_t)(pu8RXBuf[2]) << 8) | ((uint32_t)(pu8RXBuf[3]) << 16) | ((uint32_t)(pu8RXBuf[4]) << 24);;
            break;

        case E_CMD_TYPE1_SPECIFY_WHEEL_MSK:
            psTkInfo->u32EnWheelMsk = pu8RXBuf[1] | ((uint32_t)(pu8RXBuf[2]) << 8) | ((uint32_t)(pu8RXBuf[3]) << 16) | ((uint32_t)(pu8RXBuf[4]) << 24);
            break;

        case E_CMD_TYPE1_SPECIFY_REF_SHIELD_NO:
            psTkInfo->u8RefChan = pu8RXBuf[1];
            psTkInfo->u8ShieldChan = pu8RXBuf[2];
            psTkInfo->u8SliderRes = pu8RXBuf[3];
            psTkInfo->u8WheelRes = pu8RXBuf[4];
            break;

        case E_CMD_TYPE1_SPECIFY_FEATURE:
            psTkFeat->u8EnIIR = pu8RXBuf[1];
            psTkFeat->u8EnDebounce = pu8RXBuf[2];
            psTkFeat->u8EnBaseLineTrace = pu8RXBuf[3];
            break;

        case E_CMD_TYPE1_SPECIFY_SENSE:
            psTkInfo->u8SenPulse = pu8RXBuf[1];             /* Sense Pulse Width  */
            psTkInfo->u8SenTimes = pu8RXBuf[2];             /* Sense Times  */
            psTkInfo->u8PolarityCapacitorBank = 2;          /* Specified the level for enabled channels on non-measured period */
            break;

        case E_CMD_TYPE1_SPECIFY_RESET_VOL:
            psTkFeat->u16ResetTime = pu8RXBuf[1] | ((uint16_t)(pu8RXBuf[2]) << 8);
            psTkInfo->u8AvcchLevel = 7;
            break;

        case E_CMD_TYPE1_SPECIFY_STORE_ADDR:
            psTkInfo->u32StoreAddr = pu8RXBuf[1] | ((uint32_t)(pu8RXBuf[2]) << 8) | ((uint32_t)(pu8RXBuf[3]) << 16) | ((uint32_t)(pu8RXBuf[4]) << 24);
            break;

        case E_CMD_TYPE1_SPECIFY_NEIGHBORING:
#ifdef OPT_NEIGHBOR
            psKeyNeighbor[pu8RXBuf[1]].left = pu8RXBuf[2];
            psKeyNeighbor[pu8RXBuf[1]].right = pu8RXBuf[3];
#endif
            break;

        case E_CMD_TYPE1_SPECIFY_CHANNEL_PIN:
            if (pu8RXBuf[1] < 16)
                psTkFeat->u32PinSel = (psTkFeat->u32PinSel & ~(0x3 << (pu8RXBuf[1]) * 2)) | ((pu8RXBuf[2] & 0x3) << (pu8RXBuf[1] * 2));
            else
                psTkFeat->u32PinSel1 = (psTkFeat->u32PinSel1 & ~(0x3 << ((pu8RXBuf[1] - 16) * 2))) | ((pu8RXBuf[2] & 0x3) << ((pu8RXBuf[1] - 16) * 2));

            break;

