OpenNuvoton/M251BSP/SampleCode/PowerManagement/TK_PowerDownMode/TK_UartCmd.c
        case E_CMD_TYPE1_START_CALIBRATION:     /* It took a long time to calibration */

            if (pu8RXBuf[1] == 0)
                psTkInfo->u8NoiseImmunity = 0x13;
            else if (pu8RXBuf[1] == 1)
                psTkInfo->u8NoiseImmunity = 0x12;
            else
                psTkInfo->u8NoiseImmunity = 0x23;

            if (pu8RXBuf[2] == 0)
            {
                /* Start Calibration */
                gu8Calibration = E_UNDER_CALIBRATION;
                i8Ret = 1;
            }
            else
            {
                /* Start Mass-Production Test */
#ifdef MASS_FINETUNE
                gu8Calibration = E_CALIBRATION_DONE_FREERUN;
                psTkFeat->u8BaseLineRound = 1;
                /* Install Fine Tue Time out function for Mass Production*/
                TK_MP_Open();
#endif
            }

            break;

        case E_CMD_TYPE1_RESET_CALIBRATION1:
            u8Chan = pu8RXBuf[1];
            (pKeyInfo + u8Chan)->ccb  = pu8RXBuf[2];
            (pKeyInfo + u8Chan)->refcb = pu8RXBuf[3];
            break;

        case E_CMD_TYPE1_RESET_CALIBRATION2:
            u8Chan = pu8RXBuf[1];
            (pKeyInfo + u8Chan)->level  = pu8RXBuf[2];
            (pKeyInfo + u8Chan)->threshold = pu8RXBuf[3];
            break;

        case E_CMD_TYPE1_WRITE_CALIBRATION:
            TK_SavePara();                                  /* After save parameter, Enable free run */
            TK_LoadPara(&u32Data);

            break;

        case E_CMD_TYPE1_LOAD_CALIBRATION:
            TK_LoadPara(&u32Data);
            break;

        case E_CMD_TYPE1_START_RUN_TIME_SCAN_KEY:
            gu8RunTimeKeyInfo = 1;
            {
                uint8_t chan;

                for (chan = 0; chan < TKLIB_TOL_NUM_KEY; chan = chan + 1)
                {
                    (pKeyInfo + chan)->level = 0;
                }
            }
            i8Ret = 2;
            break;

        case E_CMD_TYPE1_ESCAPE_RUN_TIME_SCAN_KEY:
            gu8RunTimeKeyInfo = 0;
            i8Ret = 3;
            break;

        case E_CMD_TYPE1_ESCAPE_APPLICATION:
            /* Escap to free run case */
            break;

        case E_CMD_TYPE1_IIR_PARAMETER:
            psTkFeat->u8IIRNew = pu8RXBuf[1];
            psTkFeat->u8IIROld = pu8RXBuf[2];
            break;

        case E_CMD_TYPE1_DEBOUNCE_PARAMETER:
            psTkFeat->u8Entry = pu8RXBuf[1];
            psTkFeat->u8Escape = pu8RXBuf[2];
            break;

        default:
            g_u8TXBuf[0] = 'N';
            TK_SendChars(g_u8TXBuf, 1);
            return i8Ret;
    }

    g_u8TXBuf[0] = 'A';
    TK_SendChars(g_u8TXBuf, 1);


    return i8Ret;
}

/**
  * @brief  There are total 3 bytes transfer from PC.
  *         PC : Cmd + 1 parameters + Checksum
  *         DUT: 4 parameters + 1 byte ACK/NACK only
  *
  * @param[in]  Touch key information pointer
  * @param[in]  RX buffer to receive data from PC
  * @param[in]  Length
  *
  * @return     0: Continue receive.
  *             1: Escape to do calibration
  * @details    Receive command from PC
  */
int8_t TK_CmdType2(uint8_t *pu8RXBuf)
{
    int8_t i8Ret = 0;
    uint8_t chan;
    uint8_t u8Group;
    uint32_t u32KeyStoreAddr;
    uint32_t u32PDID;
    S_TKINFO *psTkInfo;
    S_TKFEAT *psTkFeat;
    S_KEYINFO *psKeyInfo;

#ifdef OPT_NEIGHBOR
    S_NEIGHBOR *psKeyNeighbor;
    psKeyNeighbor = TK_GetNeighborInfoPtr();
#endif

    psTkFeat = TK_GetFeaturePtr();
    psKeyInfo = TK_GetKeyInfoPtr();
    psTkInfo = TK_GetTKInfoPtr();

    u32KeyStoreAddr = psTkInfo->u32StoreAddr + TK_BLOCK_OFFSET;

    for (chan = 0; chan < 5; chan = chan + 1)
    {
        g_u8TXBuf[chan] = 0x0;
    }

    switch (*pu8RXBuf)
    {
        case E_CMD_TYPE2_READ_CHANNEL_MSK:
            g_u8TXBuf[0] = psTkInfo->u32EnChanMsk;
            g_u8TXBuf[1] = psTkInfo->u32EnChanMsk >> 8;
            g_u8TXBuf[2] = psTkInfo->u32EnChanMsk >> 16;
            g_u8TXBuf[3] = psTkInfo->u32EnChanMsk >> 24;

            break;

        case E_CMD_TYPE2_READ_SLIDER_MSK:
            g_u8TXBuf[0] = psTkInfo->u32EnSliderMsk;
            g_u8TXBuf[1] = psTkInfo->u32EnSliderMsk >> 8;
            g_u8TXBuf[2] = psTkInfo->u32EnSliderMsk >> 16;
            g_u8TXBuf[3] = psTkInfo->u32EnSliderMsk >> 24;
            break;

        case E_CMD_TYPE2_READ_WHEEL_MSK:
            g_u8TXBuf[0] = psTkInfo->u32EnWheelMsk;
            g_u8TXBuf[1] = psTkInfo->u32EnWheelMsk >> 8;
            g_u8TXBuf[2] = psTkInfo->u32EnWheelMsk >> 16;
            g_u8TXBuf[3] = psTkInfo->u32EnWheelMsk >> 24;
            //g_u8TXBuf[4] = 'A';
            break;

        case E_CMD_TYPE2_READ_REF_SHIELD_NO:
            g_u8TXBuf[0] = psTkInfo->u8RefChan;
            g_u8TXBuf[1] = psTkInfo->u8ShieldChan;

            if (pu8RXBuf[1] == 0)
            {
                g_u8TXBuf[2] = psTkInfo->u8SliderRes;
                g_u8TXBuf[3] = i8SliderPercentage;
            }
            else
            {
                g_u8TXBuf[2] = psTkInfo->u8WheelRes;
                g_u8TXBuf[3] = i8WheelPercentage;
            }

            break;

        case E_CMD_TYPE2_READ_FEATURE:
            g_u8TXBuf[0] = psTkFeat->u8EnIIR;
            g_u8TXBuf[1] = psTkFeat->u8EnDebounce;
            g_u8TXBuf[2] = psTkFeat->u8EnBaseLineTrace;
            break;

        case E_CMD_TYPE2_READ_SENSE:
            g_u8TXBuf[0] = psTkInfo->u8SenPulse;
            g_u8TXBuf[1] = psTkInfo->u8SenTimes;
            g_u8TXBuf[2] = psTkInfo->u8PolarityCapacitorBank;
            break;

        case E_CMD_TYPE2_READ_RESET_VOL:
            g_u8TXBuf[0] = psTkFeat->u16ResetTime;
            g_u8TXBuf[1] = psTkFeat->u16ResetTime >> 8;
            g_u8TXBuf[2] = psTkInfo->u8AvcchLevel;
            break;

        case E_CMD_TYPE2_READ_STORE_ADDR:
            g_u8TXBuf[0] = *((uint8_t *)&psTkInfo->u32StoreAddr);
            g_u8TXBuf[1] = *((uint8_t *)&psTkInfo->u32StoreAddr + 1);
            g_u8TXBuf[2] = *((uint8_t *)&psTkInfo->u32StoreAddr + 2);
            g_u8TXBuf[3] = *((uint8_t *)&psTkInfo->u32StoreAddr + 3);
            break;

        case E_CMD_TYPE2_READ_NEIGHBORING:
#ifdef OPT_NEIGHBOR
            g_u8TXBuf[0] = psKeyNeighbor[pu8RXBuf[1]].left;
            g_u8TXBuf[1] = psKeyNeighbor[pu8RXBuf[1]].right;
#endif
            break;

