OpenNuvoton/M251BSP/SampleCode/PowerManagement/TK_PowerDownMode/TK_UartCmd.c
        case E_CMD_TYPE2_READ_CHANNEL_PIN:
            g_u8TXBuf[0] = (((pu8RXBuf[1] >= 16) ? psTkFeat->u32PinSel1 : psTkFeat->u32PinSel) >> ((pu8RXBuf[1] % 16) * 2)) & 0x3;
            break;

        case E_CMD_TYPE2_GET_CALIBRATION1:
            chan = *(pu8RXBuf + 1);

            if (chan & 0x80)
            {
                chan &= ~0x80;
                g_u8TXBuf[0] = inp8(u32KeyStoreAddr + TK_CCB_OFFSET + chan * 4);
                g_u8TXBuf[1] = inp8(u32KeyStoreAddr + TK_REFCB_OFFSET + chan * 4);
            }
            else
            {
                g_u8TXBuf[0] = (psKeyInfo + chan)->ccb;
                g_u8TXBuf[1] = (psKeyInfo + chan)->refcb;
            }

            break;

        case E_CMD_TYPE2_GET_CALIBRATION2:
            chan = *(pu8RXBuf + 1);

            if (chan & 0x80)
            {
                /* MSB bit = 1 to get manufactory setting */
                uint8_t u8Level;

                chan &= ~0x80;
                u8Level = inp8(u32KeyStoreAddr + TK_LEVEL_OFFSET + chan * 4);
                g_u8TXBuf[0] = u8Level;
                u8Level = inp8(u32KeyStoreAddr + TK_THRESHOLD_OFFSET + chan * 4);
                g_u8TXBuf[1] = u8Level;
            }
            else
            {
                /* MSB bit = 0 to do calibration flow for signal and threshold */
                TK_Calibration_Touch(chan, (psTkInfo->u8NoiseImmunity >> 4), (psTkInfo->u8NoiseImmunity & 0x0F));
                g_u8TXBuf[0] = (psKeyInfo + chan)->level;
                g_u8TXBuf[1] = (psKeyInfo + chan)->threshold;
            }

            break;

        case E_CMD_TYPE2_RUNTIME_KEY_INFO:
            i8Ret = 1;
            break;

        case E_CMD_TYPE2_GET_IIR_PARAMETER:
            g_u8TXBuf[0] = psTkFeat->u8IIRNew;
            g_u8TXBuf[1] = psTkFeat->u8IIROld;
            break;

        case E_CMD_TYPE2_GET_DEBOUNCE_PARAMETER:
            g_u8TXBuf[0] = psTkFeat->u8Entry;
            g_u8TXBuf[1] = psTkFeat->u8Escape;
            break;

        case E_CMD_TYPE2_SET_SCAN_KEY:
            if (pu8RXBuf[1] == 0)
            {
                gu8Calibration = E_CALIBRATION_DONE;
                DBG_PRINTF("Disable Scan Key\n");
            }
            else
            {
                gu8Calibration = E_CALIBRATION_DONE_FREERUN;
                DBG_PRINTF("Enable Scan Key\n");
            }

            break;

        case E_CMD_TYPE2_EXPORT_CALIBRATION:
            u32KeyStoreAddr = psTkInfo->u32StoreAddr + pu8RXBuf[1] * 4;
            g_u8TXBuf[0] = inp8(u32KeyStoreAddr);
            g_u8TXBuf[1] = inp8(u32KeyStoreAddr + 1);
            g_u8TXBuf[2] = inp8(u32KeyStoreAddr + 2);
            g_u8TXBuf[3] = inp8(u32KeyStoreAddr + 3);
            break;

#if defined(MASS_FINETUNE)

        case E_CMD_TYPE2_GET_UID:
            g_u8TXBuf[0] = (USER_ID & 0xFF000000) >> 24;
            g_u8TXBuf[1] = (USER_ID & 0xFF0000) >> 16;
            g_u8TXBuf[2] = (USER_ID & 0xFF00) >> 8;
            g_u8TXBuf[3] = (USER_ID & 0xFF);
            break;

#endif

        case E_CMD_TYPE2_GET_RUNTIME_TK_PRESSED:
            u8Group = pu8RXBuf[1] * 2;
            g_u8TXBuf[0] = asPressedTouchKeys[u8Group].u8TKChanNum;

            if (asPressedTouchKeys[u8Group].i8Count >= 2)
                g_u8TXBuf[1] = 2;
            else
                g_u8TXBuf[1] = asPressedTouchKeys[u8Group].i8Count;

            g_u8TXBuf[2] = asPressedTouchKeys[u8Group + 1].u8TKChanNum;

            if (asPressedTouchKeys[u8Group + 1].i8Count >= 2)
                g_u8TXBuf[3] = 2;
            else
                g_u8TXBuf[3] = asPressedTouchKeys[u8Group + 1].i8Count;

            break;

        case E_CMD_TYPE2_FIRMWARE_VERSION:
            if (pu8RXBuf[1] == 0)
            {
                g_u8TXBuf[0] = FIRMWARE_MAJOR_VERSION;
                g_u8TXBuf[1] = FIRMWARE_MINOR_VERSION;
                g_u8TXBuf[2] = TOUCHKEY_VERSION;
            }
            else if (pu8RXBuf[1] == 1)
            {
                g_u8TXBuf[0] = TKLIB_MAJOR_VERSION;
                g_u8TXBuf[1] = TKLIB_MINOR_VERSION;
                g_u8TXBuf[2] = TOUCHKEY_VERSION;
            }
            else
            {
                //for PDID
                u32PDID = SYS->PDID;
                g_u8TXBuf[0] = (uint8_t)((u32PDID & 0xFF000000) >> (24));
                g_u8TXBuf[1] = (uint8_t)((u32PDID & 0x00FF0000) >> (16));
                g_u8TXBuf[2] = (uint8_t)((u32PDID & 0x0000FF00) >> (8));
                g_u8TXBuf[3] = (uint8_t)((u32PDID & 0x000000FF));
            }

            break;

        default:
            g_u8TXBuf[4] = 'N';
            TK_SendChars(g_u8TXBuf, 5);
            return i8Ret;
    }

    g_u8TXBuf[4] = 'A';
    TK_SendChars(g_u8TXBuf, 5);

    return i8Ret;
}
typedef void (*f)(void);
void TK_RawDataView(void);
int8_t TK_GetPacket(uint32_t *pu32ChanelMsk)
{
    int8_t i8Ret = 0;
    S_TKINFO *psTkInfo;

    psTkInfo = TK_GetTKInfoPtr();

    do
    {
        if (gu8CmdSts == E_CMD_TYPE1_READY)
        {
            /* i8Ret will be set to 1 if E_CMD_TYPE1_START_CALIBRATION command */
            i8Ret = TK_CmdType1(g_u8RXBuf);
            UART_StateInit();
        }

        if (gu8CmdSts == E_CMD_TYPE2_READY)
        {
            /* i8Ret will always 0 */

            i8Ret = TK_CmdType2(g_u8RXBuf);
            UART_StateInit();
        }

        if (gu8CmdSts == E_CMD_TYPE1_WRONG)
        {
            g_u8TXBuf[0] = 'N';
            TK_SendChars(g_u8TXBuf, 1);
            UART_StateInit();
        }

        if (gu8CmdSts == E_CMD_TYPE2_WRONG)
        {
            uint8_t i;
            uint8_t u8Arry[5] = {0};

            printf("CMD2 W\n");
            u8Arry[4] = 'N';

            for (i = 0; i < 5; i = i + 1)
                TK_SendChars(&u8Arry[i], 1);

            UART_StateInit();
        }

        if (gu8Calibration == E_CALIBRATION_DONE_FREERUN)
        {
            TK_RawDataView();
        }

    } while (i8Ret == 0); /* Escape the loop until E_CMD_TYPE1_START_CALIBRATION command */

    *pu32ChanelMsk = (psTkInfo->u32EnChanMsk) | ((psTkInfo->u32EnSliderMsk | psTkInfo->u32EnWheelMsk)\
                                                 | (1UL << psTkInfo->u8RefChan));

