OpenNuvoton/M251BSP/SampleCode/PowerManagement/TK_PowerDownMode/TK_UartCmd.c
    if (psTkInfo->u8ShieldChan != 0xFF)
        *pu32ChanelMsk = *pu32ChanelMsk | (1UL << psTkInfo->u8ShieldChan);

    return i8Ret;
    /* Escape as receive start calibration */
}


void UART0_IRQHandler(void)
{
    uint8_t u8CmdType;
    S_KEYINFO *pKeyInfo;
    S_TKFEAT *psTkFeat;

    pKeyInfo = TK_GetKeyInfoPtr();
    psTkFeat = TK_GetFeaturePtr();

    if (UART_GET_RX_EMPTY(TK_UART_PORT))
    {
        UART_ClearIntFlag(TK_UART_PORT, UART_INTSTS_RDAINT_Msk);
        return;
    }

    if (UART_GET_INT_FLAG(TK_UART_PORT, UART_INTSTS_RDAINT_Msk))
    {
        g_u8RXBuf[gu8comRtail] = UART_READ(TK_UART_PORT);
        UART_ClearIntFlag(TK_UART_PORT, UART_INTSTS_RDAINT_Msk);
        gu8ChkSum += g_u8RXBuf[gu8comRtail];
        gu8comRtail = gu8comRtail + 1;
    }

    if (g_u8RXBuf[0] <= E_CMD_TYPE1_NUM_LAST_COMMAND)
    {
        u8CmdType = 1;
    }
    else if ((g_u8RXBuf[0] >= 'A') && (g_u8RXBuf[0] <= E_CMD_TYPE1_LAST_COMMAND))
    {
        u8CmdType = 1;
    }
    else
    {
        u8CmdType = 2;    /* Cmd = 0x10 ~ 0x16, 'a' ~ 'd' */
    }

    if (u8CmdType == 1)
    {
        do
        {
            if (UART_GET_RX_EMPTY(TK_UART_PORT) == 0)
            {
                g_u8RXBuf[gu8comRtail] = UART_READ(TK_UART_PORT);
                UART_ClearIntFlag(TK_UART_PORT, UART_INTSTS_RDAINT_Msk);

                if (gu8comRtail < 5)
                    gu8ChkSum += g_u8RXBuf[gu8comRtail];

                gu8comRtail++;
            }
        } while (gu8comRtail < 6);

        if (g_u8RXBuf[5] == gu8ChkSum)
        {
            gu8CmdSts = E_CMD_TYPE1_READY;
        }
        else
        {
            gu8CmdSts = E_CMD_TYPE1_WRONG;
        }
    }

    if (u8CmdType == 2)
    {
        do
        {
            if (UART_GET_RX_EMPTY(TK_UART_PORT) == 0)
            {
                g_u8RXBuf[gu8comRtail] = UART_READ(TK_UART_PORT);
                UART_ClearIntFlag(TK_UART_PORT, UART_INTSTS_RDAINT_Msk);

                if (gu8comRtail < 2)
                    gu8ChkSum += g_u8RXBuf[gu8comRtail];

                gu8comRtail++;
            }
        } while (gu8comRtail < 3);

        if (g_u8RXBuf[2] == gu8ChkSum)
            gu8CmdSts = E_CMD_TYPE2_READY;
        else
            gu8CmdSts = E_CMD_TYPE2_WRONG;
    }

    /* Process the run-time event - E_CMD_TYPE2_CHECK_CALIBRATION_DONE */
    if ((g_u8RXBuf[0] == E_CMD_TYPE2_CHECK_CALIBRATION_DONE) &&
            (gu8CmdSts == E_CMD_TYPE2_READY))
    {
        /* Run time get calibration status */
        uint8_t i;
        uint8_t u8Arry[5] = {0};

        if (psTkFeat->u8BaseLineRound != 1)
        {
            /* Polling Calibration done */
            if (gu8Calibration == E_UNDER_CALIBRATION)
                u8Arry[0] = 0;      /* return 0 means under calibration (untouch calibration) */
            else if (gu8Calibration == E_CALIBRATION_DONE)
                u8Arry[0] = 1;      /* return 1 means calibration done */
        }
        else
        {
#if defined(MASS_FINETUNE)

            /* Polling Mass-Productio done */
            if (g_bIsFineTuneDone == 1)
            {
                u8Arry[0]  = 1;                      /* done    */

                if (g_FineTuneDoneTimeOut == 1)
                    u8Arry[1] = 0;                   /* result: 1:pass, 0:fail  */
                else
                    u8Arry[1] = 1;

                psTkFeat->u8BaseLineRound = TRACK_BASELINE_RELOAD_TIME;
            }
            else
            {
                u8Arry[0]  = 0;   /* not done */
                u8Arry[1] = 0;    /* result   */
            }

#endif
        }

        u8Arry[4] = 'A';

        UART_StateInit();

        for (i = 0; i < 5; i = i + 1)
        {
            UART_WRITE(TK_UART_PORT, u8Arry[i]);      /* output character */

            while (UART_GET_TX_EMPTY(TK_UART_PORT) == 0);         /* wait until transmitter complete */
        }
    }

    /* Process the run-time event - E_CMD_TYPE2_RUNTIME_KEY_INFO */
    if ((g_u8RXBuf[0] == E_CMD_TYPE2_RUNTIME_KEY_INFO) &&
            (gu8CmdSts == E_CMD_TYPE2_READY))  /* Run time get Touch data */
    {

        uint8_t i;
        uint8_t u8Arry[5] = {0};
        uint8_t ch = g_u8RXBuf[1];

        u8Arry[0] = (pKeyInfo + ch)->ccb;
        u8Arry[1] = (pKeyInfo + ch)->refcb;
        u8Arry[2] = (pKeyInfo + ch)->level;
        u8Arry[3] = (pKeyInfo + ch)->threshold;

        u8Arry[4] = 'A';

        for (i = 0; i < 5; i = i + 1)
        {
            UART_WRITE(TK_UART_PORT, u8Arry[i]);      /* output character */
        }

        UART_StateInit();
    }
}

void UART_SetCalibrationDone(void)
{
    gu8Calibration = E_CALIBRATION_DONE;     /* 0 mean not under calibration */
}
